{"data":{"site":{"siteMetadata":{"title":"Haichao Blog","author":"Haichao Zhu"}},"markdownRemark":{"id":"223205d2-9cef-5d5d-9da8-900a11ae532d","excerpt":"这篇一共花了二十多分钟，因为内容都比较基础，所以写的比较随心所欲，还请多包涵。矿业本质是一个投（xi）资（qian…","html":"<blockquote>\n<p>这篇一共花了二十多分钟，因为内容都比较基础，所以写的比较随心所欲，还请多包涵。</p>\n</blockquote>\n<p>矿业本质是一个投（xi）资（qian）行业。投资人用法币购买矿机，将矿机托管在矿场，产生算力送到矿池，获取币本位收益，最后再完成一次币兑法币的交易。</p>\n<p>这个过程一共需要至少五个生产要素：矿机，矿场，矿池，托管，交易。</p>\n<h2>矿机</h2>\n<p>评估一个矿机主要看两个参数：算力（TH/s）和单位功耗（J/T）。比如比特大陆最新发的 S17+ 就有着 73T 的标称算力和 2920W 的标称功率，单位功耗为 40J/T，算是目前最低的了。</p>\n<p>直到今年之前，矿机效率的提升基本上都靠芯片制程的提升，从 28nm 到 16nm，再到嘉楠耘智在去年发布的 7nm 芯片 A3207，每次提升基本都能让算力翻倍，功耗减半。但制程这条路目前已经走到头了，毕竟就算是 iPhone 的现在用的也就是 7nm 的芯片。虽然有新闻说明年台积电会开始接受 5nm 的订单，但是理论上 7nm 到 5nm 可能已经不会为矿机带来特别大的性能提升了，而且新工艺价格估计也是贵的一逼，所以整体性价比堪忧。</p>\n<p>矿机市场基本上被三家占有：生产蚂蚁矿机的比特大陆，生产阿瓦隆矿机的嘉楠耘智，和生产神马矿机的比特微。比特大陆之前上市被拒，而嘉楠耘智是今年刚提交了申请。毕竟今年开始可能就不会有性能提升很多的产品为他们带来新的增长了，所以也可以理解为啥这么着急上市。同时各家也都在为各自的产品寻找新的突破点，比如阿瓦隆这两天新发布的 A11 系列就实现了串联部署，相信会给机房小哥节约不少时间。</p>\n<h2>矿场</h2>\n<p>矿场主要看两个方面，即规模和电价。规模一般以供电量来评估，小的一般几十兆瓦，大的有一两百兆瓦的。电价方面，国内基本上在4到5美分之间，包托管费，有丰水和枯水之分。国外也有一些，比如伊朗，电价也就两美分，但就怕是有命去没命回来啊。再比如美国，美国有三个电网，东边一个，西边一个，德州一个，所以德州也有一些矿场在运营。</p>\n<p>建造一个矿场首先要考虑的就是位置。电价和接入电网的成本，有没有可靠的网络，物流是否方便，政策是否稳定等等。所以仅仅是矿场选址的成本就已经不低。其次还要操心施工，包括搭建变压器，厂房，散热设备，消防设备等等。这其中以散热最为讲究，北方空气干燥但风沙大，所以一般选择用风冷加过滤；而南方风沙小但潮湿，所以一般选择水冷。除此之外还要考虑散热口的位置以及冷区和热区的隔离等等。一切都是为了给矿机们营造一个能发挥其最大算力的环境。</p>\n<p>建矿场最牛逼的恐怕还得是比特大陆。不仅在标准化矿场搭建方面有着充足的经验，比特大陆还推出了一款名为 AntBox 的产品。一个 AntBox 其实就是个集装箱，里面自带三百多台 S9，功率差不多有半兆瓦，自配了整套的散热设备，可以直接用个叉车运来运去的，空间不够还可以摞起来，摞三层一点事没有。不过问题在于明年减半之后，S9 可能不可避免的要被淘汰了，不知道 AntBox 能不能兼容 S17 呢。</p>\n<h2>矿池</h2>\n<p>矿池主要看算力大小和服务费率。一般现在的比特币矿工都会选择用 PPS+ 模式挖矿，即区块奖励按 shares 分，手续费按区块分。这种情况下，算力大的矿池才有可能出块，才有可能实现盈亏平衡；小矿池就很难为矿工挖出的 shares 们支付奖励了，资金链很快就会断的稀碎。所以算力本身也就为矿池构成了一条护城河。</p>\n<p>相比之下，矿池的技术难度不是最高的，现在几个大矿池都是几个大佬当年单打独斗搞起来的。但是技术上依然是有一定成本的，这主要体现在防 DDos 攻击上。同时矿池还要接受同行的扣块攻击带来的损失，这方面目前还没有可靠的解决方案。</p>\n<p>矿池市场相对较分散一点，除了领头的四家：F2Pool，币印，蚂蚁矿池和 BTC.COM，还有四家处于长尾之中的矿池：ViaBTC，火币矿池，莱比特和 Slush Pool。各家都有各家的法宝，莱比特提供矿机团购和托管服务，币印在全国各地请客吃饭，蚂蚁和 BTC.COM 背靠比特大陆。总的来说矿池市场是最接近完全竞争市场的，各家都必须凭本事吃饭，才有可能保住自己的一席之地。</p>\n<h2>托管</h2>\n<p>很多托管业务喜欢在路演的时候讲技术，但其实作为客户来说，我们只用担心两件事：一旦我的币丢了，它能不能赔的起，它愿不愿意赔。判断这两点的依据，就是这个提供托管服务的公司的市场份额和品牌形象了。把钱放在币安 Coinbase，肯定要比放在抹茶靠谱的多。</p>\n<p>托管业务的成本主要来自于安全性的保证和合规。安全性方面，大部分方案采用多签，冷热端分离和白名单等方式减少风险。也有一些听起来很牛逼的整合了 AI 的方案，即通过拟合客户的交易数据，来判断热端应该放多少比例的资金够用。合规方面，既然是要接收和发送资金的业务，那必然是需要接受监管的，例如 Coinbase Custody 就声明他们与传统金融托管机构一样，是接受 NYDFS 的监管的。</p>\n<p>托管业务目前比较有名的就是 Coinbase Custody 了，得益于其 Coinbase 的 branding。还有国内的 Cobo Custody，得益于其 Cobo Wallet 的 branding，并且在国内为多家交易所提供托管解决方案。</p>\n<h2>交易</h2>\n<p>矿工的交易一般有两方面的需求：一方面是法币与比特币的兑换，用来交电费；一方面是衍生品交易，用来做套保以规避币价波动带来的风险。既然是法币交易，那肯定是场外交易。一般选择的时候也是找有保障的，有足够单子的平台。套保可以选择用期货合约，也可以选择用期权，原则上也是选择比较有保障的平台来做，防止被爆仓。</p>\n<p>场外交易需要合规，在不合规的平台做交易有收到黑钱的风险。衍生品交易需要平台选择一个靠谱的价格参考，否则可能会被恶意攻击导致大规模爆仓。</p>\n<p>场外交易市场有火币的 OTC 交易，还有一个叫 localbitcoin 的平台，都属于买单卖单比较多的平台。衍生品交易比较有名的是 Bitmex 的期货合约交易，还有最新上线的 Bakkt。期权交易目前为止还没有看到特别靠谱的。</p>","frontmatter":{"title":"A Quick Recap of 矿业","date":"October 14, 2019","description":"矿业本质是一个投（xi）资（qian）行业。投资人用法币购买矿机，将矿机托管在矿场，产生算力送到矿池，获取币本位收益，最后再完成一次币兑法币的交易。这个过程一共需要至少五个生产要素：矿机，矿场，矿池，托管，交易。"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/A Quick Recap of 矿业/","previous":{"fields":{"slug":"/settlement-assurances/"},"frontmatter":{"title":"这叫交易结算保证，小傻瓜"}},"next":{"fields":{"slug":"/挖矿二三事/"},"frontmatter":{"title":""}}}}